app/Controllers/Home.php

SELECT *
FROM `users`
 LIMIT 25
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        echo view('/inc/header');
        $data['users'] = $this->user->paginate(25,'group1');

INSERT INTO `users` (`username`, `email`) VALUES ('ayush', 'aswe@gmail.com')
---
    public function saveUser(){

        $username = $this->request->getVar('username');
        $email = $this->request->getVar('email');

        $this->user->save(["username" => $username, "email"=>$email]);

UPDATE `users` SET `username` = 'assddff', `email` = 'asweff@gmail.com'
WHERE `users`.`id` IN ('72')
---
    public function updateUser(){

        // now we will get the updated value of the variable by his name
        $id = $this->request->getVar('updateId');

        $username = $this->request->getVar('username');

        $email = $this->request->getVar('password');

        // now we will store the updated value in the array

        $data['username'] = $username;
        $data['email'] = $email;

        //now we wiil update the data into database using update function

        $this->user->update($id,$data);

DELETE FROM `users`
WHERE `id` IN ('73')
---
    public function deleteUser(){

        //this $id is coming from data section of the ajax

        $id = $this->request->getVar('id');

        $this->user->delete($id);

DELETE FROM `users`
WHERE `id` IN ('293')
---
    public function deleteMultiUser(){

        $ids = $this->request->getVar('ids');

        //now deleting the multiple users using loop

        for($count = 0;$count< count($ids);$count++){

            $this->user->delete($ids[$count]);

SELECT *
FROM `users`
---
    public function downloadfile(){

    header('Content-Type: application/vnd.ms-excel');
    header('Content-Disposition: attachment;filename="hello.xlsx"');
    $spreadsheet = new Spreadsheet();
    $activeWorksheet = $spreadsheet->getActiveSheet();
    $activeWorksheet->setCellValue('A1', 'Username');
    $activeWorksheet->setCellValue('B1', 'Email');

    $userData  = $this->user->findAll();